const _0x4326 = (function() {
  const _0x3e917a = [
    'shift', 'عمي/ت', 'بطه تشان 😂❤️', 'وعليكم السلام', 'reply', '1663384HuBJML', 
    '4562928lqOyYq', 'العفو✨🥺♥', ' الشكر لله ✨💜', 'الحزين💔', 'random', 
    '🙂 الحمد لله ماشي الحال ', '14195cxcHYi', '654676jguwoP', '😂😂😂❤️دوم دي ضحكة ', 
    '20176OQvkVk', '1JtYMfM', 'اوكي ✨💜', 'و انا', '9635BxTiyO', '290TTnTlZ', 
    ' وعليكم السلام كيفك', ' لو انت كويس انا كويس', '🥰كل شيء بخير الحمد لله ', 
    '577710bKraHe', 'ايه ال بيضحك🌚', '2876454EazEAf', 'text', '216RuIuNK', 
    '4368yhQxtX', '3610740TFqyFl', 'all', ' سوبر مان🫡❤️‍🔥', 'روح نام تاني بقي 🙃', 
    '2028938UaVMVM','push', 'كتكوت كيوت 🥺❤️', 'اسكتتتتت عشان مضربكش عيب الكلام ده ', 
    'chat', 'طيب و بعدين ', '😂😂😂❤️', 'خلاص لا اتكسف ', ' صباح الكاريزما ✨💜', 'شكرا  ', 
    'test', 'تسلم ايدك ✨💜 ', ' ضحكني معاك', 'هفكر في الموضوع', '670uAeWOE', 
    ' ولا يهمك مفيش حاجه✨💫 ', '9059608skOWjw', '❤️الحمد الله', 'عاش المحرز ✨💜', 
    'عيل لول 🐦', '18291lcFrqI', '🥺💔ملكش دعوه ', ' اتأدب ', '🥺 لا وانت مالك', 'يارب دايما❤️ ', 
    'عيب ', '716rgtRUM', 'العفو يا باشا ✨💜', 'chats', '2965616fUoKdE', '3MAzcJx'
  ];

  return function(_0x4326c7, _0x4a5244) {
    _0x4326c7 = _0x4326c7 - 0x66;
    let _0x55ccd1 = _0x3e917a[_0x4326c7];
    return _0x55ccd1;
  };
})();
